Repository: cronomantic/ChooseYourDestiny
Catalog: locale/*/LC_MESSAGES/make_adventure_gui.po
Languages: es

source: Paths
es: Rutas

source: Compiler
es: Compilador

source: Post‑build
es: Post‑compilación

source: Appearance
es: Apariencia

source: Reset to Defaults
es: Restablecer valores predeterminados

source: Close
es: Cerrar

source: File & Directory Paths
es: Rutas de archivos y directorios

source: Output path:
es: Ruta de salida:

source: Images path:
es: Ruta de imágenes:

source: Tracks path:
es: Ruta de pistas:

source: SFX ASM file:
es: Archivo ASM de efectos de sonido:

source: Loading screen (.scr):
es: Pantalla de carga (.scr):

source: Tokens file:
es: Archivo de tokens:

source: Charset file:
es: Archivo de caracteres:

source: SjASMPlus executable:
es: Ejecutable SjASMPlus:

source: Browse…
es: Explorar…

source: Image Settings
es: Ajustes de imagen

source: Image lines (1–192):
es: Líneas de imagen (1–192):

source: Number of horizontal lines used in SCR files
es: Número de líneas horizontales usadas en archivos SCR

source: Abbreviation Search
es: Búsqueda de abreviaturas

source: Min length:
es: Longitud mínima:

source: Max length:
es: Longitud máxima:

source: Superset limit:
es: Límite de superconjunto:

source: Flags
es: Opciones

source: Pause After Load
es: Pausa después de cargar

source: Seconds (empty = no pause):
es: Segundos (vacío = sin pausa):

source: Run Emulator After Compilation
es: Ejecutar emulador tras la compilación

source: Do nothing
es: No hacer nada

source: Internal (Zesarux in ./tools/zesarux/)
es: Interno (Zesarux en ./tools/zesarux/)

source: System default application
es: Aplicación predeterminada del sistema

source: Backup
es: Copia de seguridad

source: Backup .cyd file after successful compilation (to ./BACKUP/)
es: Hacer copia de seguridad del archivo .cyd tras una compilación exitosa (en ./BACKUP/)

source: Application Font
es: Fuente de la aplicación

source: Font size:
es: Tamaño de fuente:

source: Size of the general UI font (requires restart)
es: Tamaño de la fuente general de la interfaz (requiere reinicio)

source: Log Window
es: Ventana de registro

source: Font:
es: Fuente:

source: Text colour:
es: Color del texto:

source: Choose…
es: Elegir…

source: Background colour:
es: Color de fondo:

source: Log Preview
es: Vista previa del registro

source: This is a preview of the log window.
es: Esta es una vista previa de la ventana de registro.

source: Compilation finished successfully!
es: ¡Compilación finalizada con éxito!

source: Apply Appearance
es: Aplicar apariencia

source: Choose colour
es: Elegir color

source: Are you sure you want to reset all settings to their default values?
es: ¿Está seguro de que desea restablecer todos los ajustes a sus valores predeterminados?

source: Choose Your Destiny
es: Elige tu Destino

source: Project
es: Proyecto

source: Game name:
es: Nombre del juego:

source: (the .cyd file must match this name)
es: (el archivo .cyd debe coincidir con este nombre)

source: Target:
es: Objetivo:

source: ⚙ Configure…
es: ⚙ Configurar…

source: ▶ Compile
es: ▶ Compilar

source: Clear Log
es: Limpiar registro

source: Build Output
es: Salida de compilación

source: Game name cannot be empty.
es: El nombre del juego no puede estar vacío.

source: Input file does not exist:
es: El archivo de entrada no existe:

source: SjASMPlus executable not found:
es: No se encontró el ejecutable SjASMPlus:

source: Output path does not exist:
es: La ruta de salida no existe:

source: Pause value must be a non‑negative integer (seconds) such that value × 50 < 65536.
es: El valor de pausa debe ser un entero no negativo (segundos) tal que valor × 50 < 65536.

source: Compiling '{}' for {}…
es: Compilando '{}' para {}…

source: ERROR: Compiler exited with code {}.
es: ERROR: El compilador terminó con el código {}.

source: ERROR running CYDC: {}
es: ERROR al ejecutar CYDC: {}

source: Cleaning temporary files…
es: Limpiando archivos temporales…

source: Removed {}
es: Eliminado {}

source: Backup saved to {}
es: Copia de seguridad guardada en {}

source: Backup failed: {}
es: Error en la copia de seguridad: {}

source: Cannot run emulator – file not found: {}
es: No se puede ejecutar el emulador – archivo no encontrado: {}

source: Opening {} with default application…
es: Abriendo {} con la aplicación predeterminada…

source: Failed to open file: {}
es: Error al abrir el archivo: {}

source: Zesarux not found at {}
es: Zesarux no encontrado en {}

source: Launching Zesarux: {} {}
es: Iniciando Zesarux: {} {}

source: Failed to launch Zesarux: {}
es: Error al iniciar Zesarux: {}

source: ERROR: Python 3 is required.
es: ERROR: Se requiere Python 3.
