Repository: cronomantic/ChooseYourDestiny
Catalog: src/cydc/cydc/locale/*/LC_MESSAGES/cydc.po
Languages: es

source: ERROR: Invalid python version
es: ERROR: Versión de Python no válida

source: MIN_LENGTH
es: LONG_MINIMA

source: minimum abbreviation length (default: %(default)d)
es: longitud mínima de abreviatura (por defecto: %(default)d)

source: MAX_LENGTH
es: LONG_MAXIMA

source: maximum abbreviation length (default: %(default)d)
es: longitud máxima de abreviatura (por defecto: %(default)d)

source: SUPERSET_LIMIT
es: LIMITE_SUPERCONJUNTO

source: limit for the superset search heuristic (default: %(default)d)
es: límite para la heurística de búsqueda de superconjuntos (por defecto: %(default)d)

source: EXPORT-TOKENS_FILE
es: ARCHIVO-EXPORTAR-TOKENS

source: file to export the found tokens
es: archivo para exportar los tokens encontrados

source: IMPORT-TOKENS-FILE
es: ARCHIVO-IMPORTAR-TOKENS

source: file with the tokens to use
es: archivo con los tokens a usar

source: EXPORT-CHARSET
es: EXPORTAR-CHARSET

source: file to export the current character set
es: archivo para exportar el conjunto de caracteres actual

source: IMPORT-CHARSET
es: IMPORTAR-CHARSET

source: file with the character set to use
es: archivo con el conjunto de caracteres a usar

source: The text string will be sliced between two banks
es: La cadena de texto se dividirá entre dos bancos

source: NAME
es: NOMBRE

source: Name of the output file
es: Nombre del archivo de salida

source: Use 720 Kb disk images
es: Usar imágenes de disco de 720 Kb

source: NUM_IMAGE_LINES
es: NUM_LINEAS_IMAGEN

source: Number of lines of the image to use (default: %(default)d)
es: Número de líneas de la imagen a usar (por defecto: %(default)d)

source: Use WYZ tracker instead of Vortex tracker
es: Usar el tracker WYZ en lugar del tracker Vortex

source: path to the directory with the Spectrum screens
es: ruta al directorio con las pantallas de Spectrum

source: path to the directory with the music tracks
es: ruta al directorio con las pistas de música

source: path to the asm file generated by beepfx
es: ruta al archivo asm generado por beepfx

source: path to the SCR file used as Loading screen
es: ruta al archivo SCR usado como pantalla de carga

source: show additional information (-v for level 1, -vv for level 2, etc.)
es: mostrar información adicional (-v para nivel 1, -vv para nivel 2, etc.)

source: exclude code of unused commands
es: excluir el código de comandos no utilizados

source: show the generated bytecode
es: mostrar el bytecode generado

source: Number of seconds of pause after finishing the loading process, can be aborted with any keypress.
es: Número de segundos de pausa tras finalizar el proceso de carga, puede abortarse con cualquier tecla.

source: show program's version number and exit
es: mostrar el número de versión del programa y salir

source: Model of spectrum to target
es: Modelo de Spectrum como objetivo

source: input.cyd
es: entrada.cyd

source: input filename, the script for the adventure
es: nombre del archivo de entrada, el script de la aventura

source: SJASMPLUS_PATH
es: RUTA_SJASMPLUS

source: path to sjasmplus executable
es: ruta al ejecutable sjasmplus

source: OUTPUT_PATH
es: RUTA_SALIDA

source: Output path to files
es: Ruta de salida para los archivos

source: ERROR: File not found:
es: ERROR: Archivo no encontrado:

source: ERROR: Not a valid path:
es: ERROR: No es una ruta válida:

source: ERROR: Invalid parameter this model.
es: ERROR: Parámetro no válido para este modelo.

source: ERROR: Path to input file does not exist.
es: ERROR: La ruta al archivo de entrada no existe.

source: Parameters parsed in {tmp_timer}
es: Parámetros procesados en {tmp_timer}

source: Path to token file does not exist.
es: La ruta al archivo de tokens no existe.

source: ERROR: The token import file has not a valid format.
es: ERROR: El archivo de importación de tokens no tiene un formato válido.

source: ERROR: Number of tokens must be equal o less to %(NUM_TOKENS)d.
es: ERROR: El número de tokens debe ser igual o menor que %(NUM_TOKENS)d.

source: Tokens imported in {tmp_timer}
es: Tokens importados en {tmp_timer}

source: Path to charset file does not exist.
es: La ruta al archivo de caracteres no existe.

source: ERROR: The charset import file has not a valid format.
es: ERROR: El archivo de importación de caracteres no tiene un formato válido.

source: ERROR: Too many characters!
es: ERROR: ¡Demasiados caracteres!

source: Character set loaded in {tmp_timer}
es: Conjunto de caracteres cargado en {tmp_timer}

source: Parsing code...
es: Analizando código...

source: Symbols:
es: Símbolos:

source: Code parsing completed ({tmp_timer})
es: Análisis de código completado ({tmp_timer})

source: Compressing texts...
es: Comprimiendo textos...

source: ERROR: min-length can't be greather than max-length.
es: ERROR: min-length no puede ser mayor que max-length.

source: Text compression completed ({tmp_timer})
es: Compresión de texto completada ({tmp_timer})

source: Reading external files...
es: Leyendo archivos externos...

source: ERROR: Invalid number of image lines {args.image_lines}.
es: ERROR: Número de líneas de imagen no válido {args.image_lines}.

source: {fpath} is set with {scr_num_lines} lines.
es: {fpath} está configurado con {scr_num_lines} líneas.

source: {fpath} has forced simmetry.
es: {fpath} tiene simetría forzada.

source: ERROR: Invalid SCR file, it is too big
es: ERROR: Archivo SCR no válido, es demasiado grande

source: Images processing completed ({tmp_timer})
es: Procesamiento de imágenes completado ({tmp_timer})

source: Reading WyzTracker files...
es: Leyendo archivos WyzTracker...

source: Track {i:03d} compressed: {len(b)} bytes to {len(b2)} bytes (delta={delta}).
es: Pista {i:03d} comprimida: {len(b)} bytes a {len(b2)} bytes (delta={delta}).

source: ERROR: File {fpath1} not found.
es: ERROR: Archivo {fpath1} no encontrado.

source: Reading PT3 files...
es: Leyendo archivos PT3...

source: ERROR: Invalid PT3 file {fpath}, it is too big
es: ERROR: Archivo PT3 no válido {fpath}, es demasiado grande

source: Tracks processing completed ({tmp_timer})
es: Procesamiento de pistas completado ({tmp_timer})

source: Reading loading screen...
es: Leyendo pantalla de carga...

source: ERROR: Invalid SCR file
es: ERROR: Archivo SCR no válido

source: ERROR: Can't open load SCR file.
es: ERROR: No se puede abrir el archivo SCR de carga.

source: Assembling WyzTracker bank...
es: Ensamblando banco WyzTracker...

source: ERROR: Invalid WyzTracker code generation.
es: ERROR: Generación de código WyzTracker no válida.

source: ERROR: Track {k} doens't fit on available space in bank 1!
es: ERROR: La pista {k} no cabe en el espacio disponible en el banco 1!

source: Assembling interpreter for size...
es: Ensamblando intérprete para el tamaño...

source: ERROR: Error assembling interpreter.
es: ERROR: Error al ensamblar el intérprete.

source: ERROR: Interpreter too big!
es: ERROR: ¡El intérprete es demasiado grande!

source: Memory organization for disk version...
es: Organización de memoria para la versión en disco...

source: Memory organization for tape version...
es: Organización de memoria para la versión en cinta...

source: ERROR: Block too big.
es: ERROR: Bloque demasiado grande.

source: ERROR: Not enough memory available
es: ERROR: No hay suficiente memoria disponible

source: ERROR: Unexpected data
es: ERROR: Datos inesperados

source: Bank [1]: Reserved for WyzTracker.
es: Banco [1]: Reservado para WyzTracker.

source: Assembling Spectrum 128k TAP...
es: Ensamblando TAP para Spectrum 128k...

source: Assembling Spectrum PLUS3 binary files...
es: Ensamblando archivos binarios para Spectrum PLUS3...

source: Assembling Spectrum 48k TAP...
es: Ensamblando TAP para Spectrum 48k...

source: ERROR: Error assembling source.
es: ERROR: Error al ensamblar el código fuente.

source: Assembling PLUS3 disk...
es: Ensamblando disco PLUS3...

source: TAP/DSK generation completed ({tmp_timer})
es: Generación de TAP/DSK completada ({tmp_timer})

source: Compilation successful in {timer}
es: Compilación exitosa en {timer}

source: ERROR: Invalid constant {k}!
es: ERROR: Constante {k} no válida!

source: ERROR: Invalid constant {k}, {c}!
es: ERROR: Constante {k}, {c} no válida!

source: ERROR: Invalid constant {k}, {op}!
es: ERROR: Constante {k}, {op} no válida!

source: ERROR: Invalid constant operation {k}, {op}!
es: ERROR: Operación de constante {k}, {op} no válida!

source: ERROR: Invalid constant operation {k}!
es: ERROR: Operación de constante {k} no válida!

source: ERROR: Invalid constant value {k}, must not be negative!
es: ERROR: Valor de constante {k} no válido, no debe ser negativo!

source: ERROR: Invalid constant value {k}, {c}!
es: ERROR: Valor de constante {k}, {c} no válido!

source: ERROR: Constant {c[1]} does not exists!
es: ERROR: La constante {c[1]} no existe!

source: ERROR: Invalid constant expression, {op}!
es: ERROR: Expresión de constante no válida, {op}!

source: ERROR: Invalid constant expression operation {op}!
es: ERROR: Operación de expresión de constante no válida {op}!

source: ERROR: Invalid constant expression {c}!
es: ERROR: Expresión de constante no válida {c}!

source: ERROR: Invalid constant expression operation!
es: ERROR: Operación de expresión de constante no válida!

source: ERROR: Invalid constant expression value {c} is not a word!
es: ERROR: Valor de expresión de constante no válido {c}, no es una palabra!

source: ERROR: Invalid constant expression value {c} is not a byte!
es: ERROR: Valor de expresión de constante no válido {c}, no es un byte!

source: ERROR: Invalid constant expression value {c}!
es: ERROR: Valor de expresión de constante no válido {c}!

source: ERROR: Constant {q} is already declared as variable
es: ERROR: La constante {q} ya está declarada como variable

source: ERROR: Variable {q} is already declared as label
es: ERROR: La variable {q} ya está declarada como etiqueta

source: ERROR: Label {q} is already declared as array
es: ERROR: La etiqueta {q} ya está declarada como array

source: ERROR: Constant {q} declared two times!
es: ERROR: La constante {q} está declarada dos veces!

source: ERROR: Variable {q} is already declared as constant
es: ERROR: La variable {q} ya está declarada como constante

source: ERROR: Variable {q} declared two times!
es: ERROR: La variable {q} está declarada dos veces!

source: ERROR: Array {q} is already declared as variable
es: ERROR: El array {q} ya está declarado como variable

source: ERROR: Array {q} is already declared as label
es: ERROR: El array {q} ya está declarado como etiqueta

source: ERROR: Array {q} is already declared as constant
es: ERROR: El array {q} ya está declarado como constante

source: ERROR: Array {q} declared two times!
es: ERROR: El array {q} está declarado dos veces!

source: ERROR: Label {q} is already declared as variable
es: ERROR: La etiqueta {q} ya está declarada como variable

source: ERROR: Label {q} is already declared as constant
es: ERROR: La etiqueta {q} ya está declarada como constante

source: ERROR: Label {q} declared two times!
es: ERROR: La etiqueta {q} está declarada dos veces!

source: ERROR: Invalid array declaration
es: ERROR: Declaración de array no válida

source: ERROR: The array {instruction[1]} has an invalid size.
es: ERROR: El array {instruction[1]} tiene un tamaño no válido.

source: ERROR: Invalid array declaration {instruction[1]}
es: ERROR: Declaración de array no válida {instruction[1]}

source: ERROR: The array {instruction[1]} is too small for the supplied initialization data.
es: ERROR: El array {instruction[1]} es demasiado pequeño para los datos de inicialización proporcionados.

source: ERROR: Variable {c} does not exists!
es: ERROR: La variable {c} no existe!

source: ERROR: Multiple assignation of variable {c} is out of bounds!
es: ERROR: La asignación múltiple de la variable {c} está fuera de límites!

source: ERROR: Invalid opcode {opcode}!
es: ERROR: Opcode no válido {opcode}!

source: ERROR: Label {c} does not exists!
es: ERROR: La etiqueta {c} no existe!

source: ERROR: Invalid offset
es: ERROR: Desplazamiento no válido

source: Invalid opening code token in line {p[1]}
es: Token de código de apertura no válido en la línea {p[1]}

source: Invalid character '{err[2]}' (\u{ord(err[2]):04x}) in line {err[0]} and position {err[1]}
es: Carácter no válido '{err[2]}' (\u{ord(err[2]):04x}) en la línea {err[0]} y posición {err[1]}

source: Undefined codification error
es: Error de codificación no definido

source: Syntax error on GOTO at line {p.lineno(1)}, missing identifier.
es: Error de sintaxis en GOTO en la línea {p.lineno(1)}, falta identificador.

source: Syntax error on GOTO at line {p.lineno(1)}, invalid identifier.
es: Error de sintaxis en GOTO en la línea {p.lineno(1)}, identificador no válido.

source: Syntax error on GOSUB at line {p.lineno(1)}, missing identifier.
es: Error de sintaxis en GOSUB en la línea {p.lineno(1)}, falta identificador.

source: Syntax error on GOSUB at line {p.lineno(1)}, invalid identifier.
es: Error de sintaxis en GOSUB en la línea {p.lineno(1)}, identificador no válido.

source: Syntax error on LABEL at line {p.lineno(1)}, missing identifier.
es: Error de sintaxis en LABEL en la línea {p.lineno(1)}, falta identificador.

source: Syntax error on LABEL at line {p.lineno(1)}, invalid identifier.
es: Error de sintaxis en LABEL en la línea {p.lineno(1)}, identificador no válido.

source: Syntax error on BACKSPACE command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando BACKSPACE en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on NEWLINE command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando NEWLINE en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on TAB command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando TAB en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on TAB command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando TAB en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on PAGEPAUSE command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando PAGEPAUSE en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on PAGEPAUSE command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando PAGEPAUSE en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on CHAR command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando CHAR en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on CHAR command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando CHAR en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on PRINT command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando PRINT en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on PRINT command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando PRINT en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on INK command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando INK en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on INK command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando INK en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on PAPER command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando PAPER en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on PAPER command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando PAPER en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on BORDER command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando BORDER en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on BORDER command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando BORDER en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on BRIGHT command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando BRIGHT en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on BRIGHT command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando BRIGHT en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on FLASH command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando FLASH en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on FLASH command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando FLASH en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on SFX command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando SFX en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on SFX command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando SFX en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on DISPLAY command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando DISPLAY en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on DISPLAY command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando DISPLAY en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on PICTURE command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando PICTURE en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on PICTURE command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando PICTURE en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on TRACK command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando TRACK en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on TRACK command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando TRACK en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on PLAY command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando PLAY en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on PLAY command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando PLAY en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on LOOP command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando LOOP en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on LOOP command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando LOOP en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on LOAD command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando LOAD en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on LOAD command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando LOAD en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on WAIT command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando WAIT en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on WAIT command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando WAIT en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on PAUSE command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando PAUSE en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on PAUSE command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando PAUSE en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on TYPERATE command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando TYPERATE en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on TYPERATE command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando TYPERATE en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on WINDOW command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando WINDOW en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on WINDOW command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando WINDOW en la línea {p.lineno(1)}, expresión no válida.

source: Syntax error on CHARSET command at line {p.lineno(1)}, it has no argument.
es: Error de sintaxis en el comando CHARSET en la línea {p.lineno(1)}, no tiene argumento.

source: Syntax error on CHARSET command at line {p.lineno(1)}, invalid expression.
es: Error de sintaxis en el comando CHARSET en la línea {p.lineno(1)}, expresión no válida.

source: Data array '{p[2]}' on line {p.lineno(2)} must have defined a size or have initialization data.
es: El array de datos '{p[2]}' en la línea {p.lineno(2)} debe tener definido un tamaño o datos de inicialización.

source: Symbol on line {p.lineno(6)} invalid
es: Símbolo en la línea {p.lineno(6)} no válido

source: Symbol on line {p.lineno(5)} invalid
es: Símbolo en la línea {p.lineno(5)} no válido

source: Symbol on line {p.lineno(3)} invalid
es: Símbolo en la línea {p.lineno(3)} no válido

source: Symbol on line {p.lineno(2)} invalid
es: Símbolo en la línea {p.lineno(2)} no válido

source: Syntax error at line {}
es: Error de sintaxis en la línea {}

source: Syntax error at line {}: Missing ENDIF for IF
es: Error de sintaxis en la línea {}: Falta ENDIF para IF

source: Syntax error at line {}: Missing WEND for WHILE
es: Error de sintaxis en la línea {}: Falta WEND para WHILE

source: Syntax error at line {}: Missing UNTIL for DO
es: Error de sintaxis en la línea {}: Falta UNTIL para DO

source: Syntax error
es: Error de sintaxis

source: Parser not build.
es: El analizador no está construido.

source: Invalid array size on line {lineno}
es: Tamaño de array no válido en la línea {lineno}

source: Invalid byte value {val} on line {lineno}
es: Valor de byte no válido {val} en la línea {lineno}

source: Invalid word value {val} on line {lineno}
es: Valor de palabra no válido {val} en la línea {lineno}

source: Label '{symbol}' on line {lineno} was already declared before.
es: La etiqueta '{symbol}' en la línea {lineno} ya fue declarada anteriormente.

source: Variable '{symbol}' on line {lineno} was already declared before.
es: La variable '{symbol}' en la línea {lineno} ya fue declarada anteriormente.

source: Constant '{symbol}' on line {lineno} was already declared before.
es: La constante '{symbol}' en la línea {lineno} ya fue declarada anteriormente.

source: Data array '{symbol}' on line {lineno} was already declared before.
es: El array de datos '{symbol}' en la línea {lineno} ya fue declarado anteriormente.

source: Symbol '{symbol}' on line {lineno} was already declared before.
es: El símbolo '{symbol}' en la línea {lineno} ya fue declarado anteriormente.

source: Label '{symbol}' on line {lineno} was already used as variable.
es: La etiqueta '{symbol}' en la línea {lineno} ya fue usada como variable.

source: Variable '{symbol}' on line {lineno} was already used as label.
es: La variable '{symbol}' en la línea {lineno} ya fue usada como etiqueta.

source: Constant '{symbol}' on line {lineno} was already used as label.
es: La constante '{symbol}' en la línea {lineno} ya fue usada como etiqueta.

source: Data array '{symbol}' on line {lineno} was already used as label.
es: El array de datos '{symbol}' en la línea {lineno} ya fue usado como etiqueta.
