Repository: cronomantic/ChooseYourDestiny
Catalog: src/cydc/cydc/locale/*/LC_MESSAGES/cydc.po
Languages: es

source: Symbol '{symbol}' on line {lineno} was already used in other context.
es: El símbolo '{symbol}' en la línea {lineno} ya fue usado en otro contexto.

source: Label '{symbol}' on lines {lines_str} is not declared.
es: La etiqueta '{symbol}' en las líneas {lines_str} no está declarada.

source: Variable '{symbol}' on lines {lines_str} is not declared.
es: La variable '{symbol}' en las líneas {lines_str} no está declarada.

source: Constant '{symbol}' on lines {lines_str} is not declared.
es: La constante '{symbol}' en las líneas {lines_str} no está declarada.

source: Data array '{symbol}' on lines {lines_str} is not declared.
es: El array de datos '{symbol}' en las líneas {lines_str} no está declarado.

source: Symbol '{symbol}' on lines {lines_str} is not declared.
es: El símbolo '{symbol}' en las líneas {lines_str} no está declarado.

source: Label '{symbol}' on lines {lines_str} was already declared as variable on {s[1]}.
es: La etiqueta '{symbol}' en las líneas {lines_str} ya fue declarada como variable en {s[1]}.

source: Variable '{symbol}' on lines {lines_str} was already declared as label on {s[1]}.
es: La variable '{symbol}' en las líneas {lines_str} ya fue declarada como etiqueta en {s[1]}.

source: Constant '{symbol}' on lines {lines_str} was already declared as label on {s[1]}.
es: La constante '{symbol}' en las líneas {lines_str} ya fue declarada como etiqueta en {s[1]}.

source: Data array '{symbol}' on lines {lines_str} was already declared as label on {s[1]}.
es: El array de datos '{symbol}' en las líneas {lines_str} ya fue declarado como etiqueta en {s[1]}.

source: Symbol '{symbol}' on lines {lines_str} was already declared with another type on {s[1]}.
es: El símbolo '{symbol}' en las líneas {lines_str} ya fue declarado con otro tipo en {s[1]}.
